SQL CONNECTION

mysql connection

In [28]:
import mysql.connector
import pandas as pd  # Make sure to import pandas

# Establishing the connection
conn = mysql.connector.connect(
    host="localhost",
    user="root",
    password="H@ridhoni7"
)

my_cursor = conn.cursor()

In [ ]:
my_cursor.execute("drop database GLOBAL_ELECTRONICS ")

In [3]:
# Create the database if it doesn't exist
my_cursor.execute("CREATE DATABASE IF NOT EXISTS GLOBAL_ELECTRONICS")

# Select the database
my_cursor.execute("USE GLOBAL_ELECTRONICS")

Importing Data_Spark data into mysql

In [6]:
# Create the Customers table
create_table_query = '''
    CREATE TABLE IF NOT EXISTS Data_spark (
        Order_Number             INT,
        Line_Item                INT,
        Order_Date               DATE,
        Delivery_Date            DATE,
        CustomerKey              INT,
        StoreKey                 INT,
        ProductKey               INT,
        Quantity                 INT,
        Currency_Code            VARCHAR(100),
        Gender                   VARCHAR(10),
        Name                     VARCHAR(255),
        City                     VARCHAR(100),
        State_Code               VARCHAR(100),
        State                    VARCHAR(100),
        Zip_Code                 VARCHAR(200),
        Country                  VARCHAR(100),
        Continent                VARCHAR(50),
        Birthday                 DATE,
        Product_Name             VARCHAR(255),
        Brand                    VARCHAR(100),
        Color                    VARCHAR(50),
        Unit_Cost_USD            FLOAT,
        Unit_Price_USD           FLOAT,
        SubcategoryKey           INT,
        Subcategory              VARCHAR(100),
        CategoryKey              INT,
        Category                 VARCHAR(100),
        Square_Meters            FLOAT,
        Open_Date                DATE,
        Currency                 VARCHAR(100),
        Exchange                 FLOAT,
        Age                      INT,
        Profit_Margin            FLOAT,
        Revenue                  FLOAT
    );
'''

my_cursor.execute(create_table_query)
print("Table created successfully")

Table created successfully

Inserting Values

In [7]:
# Define the updated SQL insert query
insert_query = '''
    INSERT INTO Data_spark (
        Order_Number, Line_Item, Order_Date, Delivery_Date, CustomerKey, StoreKey,
        ProductKey, Quantity, Currency_Code, Gender, Name, City, State_Code, State,
        Zip_Code, Country, Continent, Birthday, Product_Name, Brand, Color, Unit_Cost_USD,
        Unit_Price_USD, SubcategoryKey, Subcategory, CategoryKey, Category, Square_Meters,
        Open_Date, Currency, Exchange, Age, Profit_Margin, Revenue
    ) VALUES (
        %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s,
        %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s,%s
        
    )
'''
# Read the CSV file into a DataFrame
df_data_spark = pd.read_csv(r"C:\Users\haris\OneDrive\Documents\hariii_note\Project 2\Dataspark.csv")

# Remove spaces from column names
df_data_spark.columns = df_data_spark.columns.str.replace(' ', '_')

# Loop to insert each row from the DataFrame
for index, row in df_data_spark.iterrows():
    my_cursor.execute(insert_query, (
        row['Order_Number'], row['Line_Item'], row['Order_Date'], row['Delivery_Date'], row['CustomerKey'],
        row['StoreKey'], row['ProductKey'], row['Quantity'], row['Currency_Code'], row['Gender'], row['Name'],
        row['City'], row['State_Code'], row['State'], row['Zip_Code'], row['Country'], row['Continent'],
        row['Birthday'], row['Product_Name'], row['Brand'], row['Color'], row['Unit_Cost_USD'],
        row['Unit_Price_USD'], row['SubcategoryKey'], row['Subcategory'], row['CategoryKey'], 
        row['Category'], row['Square_Meters'], row['Open_Date'], row['Currency'], row['Exchange'],
        row['Age'], row['Profit_Margin'], row['Revenue']
    ))

# Commit the transaction
conn.commit()
print("Values inserted successfully")

# Close the connection
conn.close()

Values inserted successfully

In [29]:
# Select the database
my_cursor.execute("USE GLOBAL_ELECTRONICS")

10 SQL Quaries

In [ ]:
! pip install tabulate

from tabulate import tabulate

In [30]:
# Execute the new query
my_cursor.execute("select * from GLOBAL_ELECTRONICS.Data_spark LIMIT 10")

# Fetch the result
out = my_cursor.fetchall()

# Print the result in a table format using 'tabulate'
print(tabulate(out, headers=[i[0] for i in my_cursor.description], tablefmt='psql'))

+----------------+-------------+--------------+-----------------+---------------+------------+--------------+------------+-----------------+----------+----------------+------------------+-----------------+-----------------+------------+----------------+---------------+------------+----------------------------------------------------+-------------------+---------+-----------------+------------------+------------------+----------------------------------+---------------+-------------------------------+-----------------+-------------+------------+------------+-------+-----------------+-----------+
|   Order_Number |   Line_Item | Order_Date   | Delivery_Date   |   CustomerKey |   StoreKey |   ProductKey |   Quantity | Currency_Code   | Gender   | Name           | City             | State_Code      | State           | Zip_Code   | Country        | Continent     | Birthday   | Product_Name                                       | Brand             | Color   |   Unit_Cost_USD |   Unit_Price_USD |   SubcategoryKey | Subcategory                      |   CategoryKey | Category                      |   Square_Meters | Open_Date   | Currency   |   Exchange |   Age |   Profit_Margin |   Revenue |
|----------------+-------------+--------------+-----------------+---------------+------------+--------------+------------+-----------------+----------+----------------+------------------+-----------------+-----------------+------------+----------------+---------------+------------+----------------------------------------------------+-------------------+---------+-----------------+------------------+------------------+----------------------------------+---------------+-------------------------------+-----------------+-------------+------------+------------+-------+-----------------+-----------|
|         366000 |           1 | 2016-01-01   | 2016-01-13      |        265598 |         10 |         1304 |          1 | CAD             | Male     | Tyler Vaught   | London           | ON              | Ontario         | N5W 5K6    | Canada         | North America | 1971-03-23 | Contoso Lens Adapter M450 White                    | Contoso           | White   |           31.27 |            68    |              406 | Cameras & Camcorders Accessories |             4 | Cameras and camcorders        |          1402.2 | 2015-12-09  | CAD        |     1.3884 |    53 |        0.540147 |     68    |
|         366001 |           1 | 2016-01-01   | 2016-01-13      |       1269051 |          0 |         1048 |          2 | USD             | Male     | Frank Upchurch | Auberry          | CA              | California      | 93602      | United States  | North America | 1995-11-20 | A. Datum SLR Camera X136 Silver                    | A. Datum          | Silver  |          141.47 |           427    |              402 | Digital SLR Cameras              |             4 | Cameras and camcorders        |          1402.2 | 2015-12-09  | USD        |     1      |    29 |        0.668689 |    854    |
|         366001 |           2 | 2016-01-01   | 2016-01-13      |       1269051 |          0 |         2007 |          1 | USD             | Male     | Frank Upchurch | Auberry          | CA              | California      | 93602      | United States  | North America | 1995-11-20 | Fabrikam Microwave 1.5CuFt X1100 Black             | Fabrikam          | Black   |          220.64 |           665.94 |              803 | Microwaves                       |             8 | Home Appliances               |          1402.2 | 2015-12-09  | USD        |     1      |    29 |        0.668679 |    665.94 |
|         366002 |           1 | 2016-01-01   | 2016-01-12      |        266019 |          0 |         1106 |          7 | CAD             | Female   | Joan Roche     | Red Deer         | AB              | Alberta         | T4N 2A6    | Canada         | North America | 1962-08-24 | Contoso SLR Camera M146 Orange                     | Contoso           | Orange  |          148.08 |           322    |              402 | Digital SLR Cameras              |             4 | Cameras and camcorders        |          1402.2 | 2015-12-09  | CAD        |     1.3884 |    62 |        0.540124 |   2254    |
|         366002 |           2 | 2016-01-01   | 2016-01-12      |        266019 |          0 |          373 |          1 | CAD             | Female   | Joan Roche     | Red Deer         | AB              | Alberta         | T4N 2A6    | Canada         | North America | 1962-08-24 | Adventure Works Laptop8.9 E0890 White              | Adventure Works   | White   |          166.2  |           326    |              301 | Laptops                          |             3 | Computers                     |          1402.2 | 2015-12-09  | CAD        |     1.3884 |    62 |        0.490184 |    326    |
|         366002 |           3 | 2016-01-01   | 2016-01-12      |        266019 |          0 |         1080 |          4 | CAD             | Female   | Joan Roche     | Red Deer         | AB              | Alberta         | T4N 2A6    | Canada         | North America | 1962-08-24 | Contoso SLR Camera X143 Silver                     | Contoso           | Silver  |          214.03 |           646    |              402 | Digital SLR Cameras              |             4 | Cameras and camcorders        |          1402.2 | 2015-12-09  | CAD        |     1.3884 |    62 |        0.668684 |   2584    |
|         366004 |           1 | 2016-01-01   | 2016-01-08      |       1107461 |         38 |          163 |          6 | GBP             | Male     | Sam Nelson     | BURSCOUGH BRIDGE | West Lancashire | West Lancashire | L40 8UX    | United Kingdom | Europe        | 1979-11-28 | Adventure Works 52" LCD HDTV X790W White           | Adventure Works   | White   |          527.53 |          1592.2  |              201 | Televisions                      |             2 | TV and Video                  |          1402.2 | 2015-12-09  | GBP        |     0.6742 |    45 |        0.668679 |   9553.2  |
|         366004 |           2 | 2016-01-01   | 2016-01-08      |       1107461 |         38 |         1529 |          2 | GBP             | Male     | Sam Nelson     | BURSCOUGH BRIDGE | West Lancashire | West Lancashire | L40 8UX    | United Kingdom | Europe        | 1979-11-28 | The Phone Company PDA Handheld 3.5 inch M610 Black | The Phone Company | Black   |          117.27 |           255    |              504 | Smart phones & PDAs              |             5 | Cell phones                   |          1402.2 | 2015-12-09  | GBP        |     0.6742 |    45 |        0.540118 |    510    |
|         366005 |           1 | 2016-01-01   | 2016-01-08      |        844003 |         33 |          421 |          4 | EUR             | Male     | Ouassim Heuver | Leeuwarden       | FR              | Friesland       | 8916 CD    | Netherlands    | Europe        | 1995-06-22 | Adventure Works Desktop PC3.0 MS300 Silver         | Adventure Works   | Silver  |          215.68 |           469    |              303 | Desktops                         |             3 | Computers                     |          1540   | 2015-12-09  | EUR        |     0.9185 |    29 |        0.540128 |   1876    |
|         366007 |           1 | 2016-01-01   | 2016-01-08      |       2035771 |         43 |         1617 |          1 | USD             | Female   | Damiana Corona | Winchester       | VA              | Virginia        | 22601      | United States  | North America | 1944-10-30 | Contoso DVD Player M110 Silver                     | Contoso           | Silver  |           26.67 |            57.99 |              602 | Movie DVD                        |             6 | Music, Movies and Audio Books |          1402.2 | 2012-08-08  | USD        |     1      |    80 |        0.540093 |     57.99 |
+----------------+-------------+--------------+-----------------+---------------+------------+--------------+------------+-----------------+----------+----------------+------------------+-----------------+-----------------+------------+----------------+---------------+------------+----------------------------------------------------+-------------------+---------+-----------------+------------------+------------------+----------------------------------+---------------+-------------------------------+-----------------+-------------+------------+------------+-------+-----------------+-----------+

1. Count of Males in company

In [39]:
my_cursor.execute("SELECT COUNT(DISTINCT CustomerKey) AS Males FROM Data_spark WHERE Gender = 'Male'")

# Fetch the result
out = my_cursor.fetchall()


# Print the result in a table format using 'tabulate'
print(tabulate(out, headers=[i[0] for i in my_cursor.description], tablefmt='psql'))

+---------+
|   Males |
|---------|
|    6029 |
+---------+

2. Count of Females in company

In [40]:
my_cursor.execute("SELECT COUNT(DISTINCT CustomerKey) AS Females FROM Data_spark WHERE Gender = 'Female'")

# Fetch the result
out = my_cursor.fetchall()

# Print the result in a table format using 'tabulate'
print(tabulate(out, headers=[i[0] for i in my_cursor.description], tablefmt='psql'))

+-----------+
|   Females |
|-----------|
|      5858 |
+-----------+

3. Total Customers

In [41]:
my_cursor.execute("SELECT COUNT(DISTINCT CustomerKey) AS TotalCustomers FROM Data_spark")

# Fetch the result
out = my_cursor.fetchall()

# Print the result in a table format using 'tabulate'
print(tabulate(out, headers=[i[0] for i in my_cursor.description], tablefmt='psql'))

+------------------+
|   TotalCustomers |
|------------------|
|            11887 |
+------------------+

4. Total Customers in Each Country

In [44]:
my_cursor.execute("SELECT Country, COUNT(CustomerKey) AS Total_Customers FROM Data_spark GROUP BY Country")

# Fetch the result
out = my_cursor.fetchall()

# Print the result in a table format using 'tabulate'
print(tabulate(out, headers=[i[0] for i in my_cursor.description], tablefmt='psql'))

+----------------+-------------------+
| Country        |   Total_Customers |
|----------------+-------------------|
| Canada         |              5415 |
| United States  |             33767 |
| United Kingdom |              8140 |
| Netherlands    |              2250 |
| Italy          |              2685 |
| France         |              1730 |
| Germany        |              5956 |
| Australia      |              2941 |
+----------------+-------------------+

5. Total Revenue

In [45]:
my_cursor.execute("SELECT SUM(Revenue) AS Total_Revenue FROM Data_spark")

# Fetch the result
out = my_cursor.fetchall()

# Print the result in a table format using 'tabulate'
print(tabulate(out, headers=[i[0] for i in my_cursor.description], tablefmt='psql'))

+-----------------+
|   Total_Revenue |
|-----------------|
|     5.57555e+07 |
+-----------------+

6.Total Quantity Sold

In [46]:
my_cursor.execute("SELECT SUM(Quantity) AS Total_Quantity_Sold FROM Data_spark")

# Fetch the result
out = my_cursor.fetchall()

# Print the result in a table format using 'tabulate'
print(tabulate(out, headers=[i[0] for i in my_cursor.description], tablefmt='psql'))

+-----------------------+
|   Total_Quantity_Sold |
|-----------------------|
|                197757 |
+-----------------------+

7. Top Products Sold by Quantity

In [48]:
my_cursor.execute("SELECT  Product_Name, SUM(Quantity) AS Total_Quantity FROM Data_spark GROUP BY Product_Name ORDER BY Total_Quantity DESC LIMIT 5")

# Fetch the result
out = my_cursor.fetchall()

# Print the result in a table format using 'tabulate'
print(tabulate(out, headers=[i[0] for i in my_cursor.description], tablefmt='psql'))

+--------------------------------------------+------------------+
| Product_Name                               |   Total_Quantity |
|--------------------------------------------+------------------|
| WWI Desktop PC2.33 X2330 Black             |              550 |
| WWI Desktop PC1.80 E1800 White             |              538 |
| Adventure Works Desktop PC1.60 ED160 Black |              521 |
| Adventure Works Desktop PC2.30 MD230 White |              521 |
| Adventure Works Desktop PC1.80 ED180 Black |              520 |
+--------------------------------------------+------------------+

7. Top Products by Revenue

In [50]:
my_cursor.execute("SELECT Product_Name, SUM(Revenue) AS Total_Revenue FROM Data_spark GROUP BY Product_Name ORDER BY Total_Revenue DESC LIMIT 5")

# Fetch the result
out = my_cursor.fetchall()

# Print the result in a table format using 'tabulate'
print(tabulate(out, headers=[i[0] for i in my_cursor.description], tablefmt='psql'))

+---------------------------------------------+-----------------+
| Product_Name                                |   Total_Revenue |
|---------------------------------------------+-----------------|
| WWI Desktop PC2.33 X2330 Black              |          505450 |
| Adventure Works Desktop PC2.33 XD233 Silver |          466089 |
| Adventure Works Desktop PC2.33 XD233 Brown  |          464151 |
| Adventure Works Desktop PC2.33 XD233 Black  |          447678 |
| Adventure Works Desktop PC2.33 XD233 White  |          437019 |
+---------------------------------------------+-----------------+

8. Least Products by Revenue

In [52]:
my_cursor.execute("SELECT Product_Name,SUM(Revenue) AS Total_Revenue FROM Data_spark GROUP BY Product_Name ORDER BY Total_Revenue ASC LIMIT 5")

# Fetch the result
out = my_cursor.fetchall()

# Print the result in a table format using 'tabulate'
print(tabulate(out, headers=[i[0] for i in my_cursor.description], tablefmt='psql'))

+-----------------------------------------------------+-----------------+
| Product_Name                                        |   Total_Revenue |
|-----------------------------------------------------+-----------------|
| SV USB Data Cable E600 Silver                       |           15.2  |
| SV USB Sync Charge Cable E700 Silver                |           15.92 |
| Litware 80mm Dual Ball Bearing Case Fan E1001 Green |           19.96 |
| SV USB Data Cable E600 Grey                         |           21.85 |
| SV USB Data Cable E600 Pink                         |           25.65 |
+-----------------------------------------------------+-----------------+

9. Top Profit Margin by products

In [56]:
my_cursor.execute("SELECT Product_Name, Profit_Margin FROM Data_spark ORDER BY Profit_Margin DESC LIMIT 5")

# Fetch the result
out = my_cursor.fetchall()

# Print the result in a table format using 'tabulate'
print(tabulate(out, headers=[i[0] for i in my_cursor.description], tablefmt='psql'))

+----------------------------------------------+-----------------+
| Product_Name                                 |   Profit_Margin |
|----------------------------------------------+-----------------|
| Contoso DVD 60 DVD Storage Binder L20 Black  |        0.668851 |
| SV DVD 60 DVD Storage Binder L20 Black       |        0.668851 |
| SV DVD 60 DVD Storage Binder L20 Red         |        0.668851 |
| Contoso DVD 60 DVD Storage Binder L20 Silver |        0.668851 |
| SV DVD 60 DVD Storage Binder L20 Silver      |        0.668851 |
+----------------------------------------------+-----------------+

10. Products Revenue by category and subcategory

In [61]:
my_cursor.execute("SELECT Category,Subcategory,SUM(Revenue) AS Total_Revenue FROM Data_spark GROUP BY Category,Subcategory ORDER BY Total_Revenue DESC LIMIT 5")

# Fetch the result
out = my_cursor.fetchall()

# Print the result in a table format using 'tabulate'
print(tabulate(out, headers=[i[0] for i in my_cursor.description], tablefmt='psql'))

+------------------------+----------------------+-----------------+
| Category               | Subcategory          |   Total_Revenue |
|------------------------+----------------------+-----------------|
| Computers              | Desktops             |     9.90636e+06 |
| TV and Video           | Televisions          |     4.30872e+06 |
| Computers              | Projectors & Screens |     3.76752e+06 |
| Home Appliances        | Water Heaters        |     3.54782e+06 |
| Cameras and camcorders | Camcorders           |     3.35799e+06 |
+------------------------+----------------------+-----------------+

11.Revenue by StoreKey

In [65]:
my_cursor.execute("SELECT StoreKey, SUM(Revenue) AS Total_Revenue FROM Data_spark GROUP BY StoreKey ORDER BY Total_Revenue DESC ")

# Fetch the result
out = my_cursor.fetchall()

# Print the result in a table format using 'tabulate'
print(tabulate(out, headers=[i[0] for i in my_cursor.description], tablefmt='psql'))

+------------+------------------+
|   StoreKey |    Total_Revenue |
|------------+------------------|
|          0 |      1.14043e+07 |
|         55 |      1.41789e+06 |
|         50 |      1.39474e+06 |
|         54 |      1.3844e+06  |
|          9 |      1.33615e+06 |
|         57 |      1.32561e+06 |
|         45 |      1.31879e+06 |
|         61 |      1.30568e+06 |
|         59 |      1.30227e+06 |
|         64 |      1.25935e+06 |
|         43 |      1.25026e+06 |
|          8 |      1.23223e+06 |
|         65 |      1.22504e+06 |
|         66 |      1.22096e+06 |
|         44 |      1.21686e+06 |
|         56 |      1.20725e+06 |
|         53 |      1.19392e+06 |
|         47 |      1.13074e+06 |
|         51 |      1.13059e+06 |
|         48 |      1.05827e+06 |
|         10 |      1.04319e+06 |
|         38 | 995313           |
|         30 | 958121           |
|         49 | 935569           |
|         29 | 913856           |
|         40 | 911596           |
|         39 | 894119           |
|         42 | 886026           |
|          5 | 859678           |
|         37 | 841994           |
|         36 | 837667           |
|         63 | 819931           |
|         24 | 673560           |
|         62 | 666303           |
|         27 | 657476           |
|         22 | 652985           |
|         23 | 615041           |
|         19 | 576575           |
|          6 | 538782           |
|          4 | 442475           |
|         34 | 434760           |
|         33 | 416859           |
|         21 | 402274           |
|         20 | 388594           |
|         41 | 383054           |
|         32 | 382595           |
|         31 | 357130           |
|         26 | 279775           |
|          1 | 243030           |
|         18 | 226079           |
|         15 | 205120           |
|         16 | 199010           |
|         28 | 187109           |
|         12 | 183091           |
|         17 | 159607           |
|         13 | 150925           |
|         14 | 105714           |
|          2 |  15176           |
+------------+------------------+

12. Revenue earned by each year

In [66]:
my_cursor.execute("SELECT YEAR(Order_Date) AS Year, SUM(Revenue) AS Total_Revenue FROM Data_spark GROUP BY YEAR(Order_Date) ORDER By Year")

# Fetch the result
out = my_cursor.fetchall()

# Print the result in a table format using 'tabulate'
print(tabulate(out, headers=[i[0] for i in my_cursor.description], tablefmt='psql'))

+--------+-----------------+
|   Year |   Total_Revenue |
|--------+-----------------|
|   2016 |     6.94679e+06 |
|   2017 |     7.42142e+06 |
|   2018 |     1.2789e+07  |
|   2019 |     1.82644e+07 |
|   2020 |     9.29463e+06 |
|   2021 |     1.03929e+06 |
+--------+-----------------+